Emacs.org
#+author: Philippe Gabriel
#+title: Emacs configuration
#+property: header-args :tangle-mode (identity #o444)

Below is a sectioned configuration of emacs. Each code blocks gets written out to its own module file before being required by the ~~/.emacs.d/init.el~ config file.

* Startup

** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-startup.el

  ;;; pg-startup.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

** Package Initialization

Some initializations are first set up.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-startup.el

  (unless (featurep 'straight)
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
          (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage)))

#+end_src

** Startup package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-startup.el

  (provide 'pg-startup)

#+end_src

* Native Compilation

** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-native-compilation.el

  ;;; pg-native-compilation.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

** Native compilation settings

Some settings specific to the ~emacs-native-comp~ version of emacs

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-native-compilation.el

  (when (featurep 'native-compile)
    (setopt native-comp-async-report-warnings-errors nil)                                          ;; Silence compiler warnings
    (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))) ;; Set directory for cache storage

#+end_src

** Native compilation package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-native-compilation.el

  (provide 'pg-native-compilation)

#+end_src

* Packages

** Guix Management

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-guix.el

  ;;; pg-guix.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | guix

Emacs interface for guix package manager.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-guix.el

  (when pg/is-guix-system
    (unless (fboundp 'guix)
      (autoload #'guix "guix" nil t))
    (unless (fboundp 'guix-devel-mode)
      (autoload #'guix-devel-mode "guix" nil t))
    (add-hook 'scheme-mode-hook #'guix-devel-mode)
    (with-eval-after-load 'general
      (pg/leader-keys
        "G" '(:ignore t :which-key "guix")
        "Gg" '(guix :which-key "guix"))))

#+end_src

*** Package | geiser

Scheme REPL

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-guix.el

  (when pg/is-guix-system
    (unless (fboundp 'geiser-guile)
      (autoload #'geiser-guile "geiser" nil t))
    (unless (fboundp 'geiser-repl-clear-buffer)
      (autoload #'geiser-repl-clear-buffer "geiser" nil t))
    (if (boundp 'geiser-repl-mode-map)
        (define-key geiser-repl-mode-map (kbd "C-l") #'geiser-repl-clear-buffer)
      (with-eval-after-load 'geiser
        (define-key geiser-repl-mode-map (kbd "C-l") #'geiser-repl-clear-buffer)))
    (unless (fboundp 'corfu-mode)
      (autoload #'corfu-mode "corfu" nil t))
    (add-hook 'geiser-repl-mode-hook #'corfu-mode)
    (add-hook 'geiser-repl-mode-hook #'(lambda ()
                                         (display-line-numbers-mode 0)))

    (with-eval-after-load 'geiser-guile
      (add-to-list 'geiser-guile-load-path (concat (plist-get pg/user :config) "/guix/current/share/guile/site/3.0"))
      (add-to-list 'geiser-guile-load-path (plist-get pg/user :dotfiles))
      (setopt geiser-guile-load-init-file nil
              geiser-guile-manual-lookup-other-window t))

    (with-eval-after-load 'geiser
      (setopt geiser-repl-company-p nil
              geiser-repl-history-filename (concat (plist-get pg/user :cache) "/.geiser_history"))))

#+end_src

*** System management package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-guix.el

  (provide 'pg-guix)

#+end_src

** Password Utilities

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  ;;; pg-passwords.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | auth-source

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (when pg/is-linux
    (require 'auth-source)
    (with-eval-after-load 'auth-source
      (setopt auth-sources (list (concat (plist-get pg/user :home)
                                         "/.authinfo.gpg")))))

#+end_src

*** Package | epg-config

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (unless (or pg/is-termux
              pg/is-windows)
    (require 'epg-config)
    (with-eval-after-load 'epg-config
      (setopt epg-pinentry-mode 'loopback)))

#+end_src

*** Package | pinentry

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (unless (or pg/is-termux
              pg/is-windows)
    (require 'pinentry)
    (with-eval-after-load 'pinentry
      (pinentry-start)))

#+end_src

*** Package | password-cache

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (require 'password-cache)
  (with-eval-after-load 'password-cache
    (setopt password-cache-expiry (* 60 60 2)))

#+end_src

*** Package | password-store

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (unless pg/is-windows
    (straight-use-package 'password-store)
    (unless (fboundp 'password-store-copy)
      (autoload #'password-store-copy "password-store" nil t))
    (unless (fboundp 'password-store-copy-field)
      (autoload #'password-store-copy-field "password-store" nil t)))
    (with-eval-after-load 'general
      (pg/leader-keys
        "a" '(:ignore t :which-key "pass")
        "ac" '(password-store-copy :which-key "copy")
        "af" '(password-store-copy-field :which-key "copy field")))
    (with-eval-after-load 'password-store
      (setopt password-store-time-before-clipboard-restore 60))

#+end_src

*** Password lookup

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (defun pg/lookup-password (&rest keys)
    "Looks up passwords from authinfo entries."
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
        nil)))

#+end_src

*** Password utilities package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-passwords.el

  (provide 'pg-passwords)

#+end_src

** Keybind Log

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-keylog.el

  ;;; pg-keylog.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | keycast

Useful when starting out with the various keybindings and when presenting to an audience.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-keylog.el

  (define-minor-mode pg/keycast-mode
    "Show current command and its key binding in the mode line.
  Fix for use with doom-mode-line."
    :global t
    (interactive)
    (if pg/keycast-mode
        (add-hook 'pre-command-hook #'keycast--update t)
      (remove-hook 'pre-command-hook #'keycast--update)))

  (straight-use-package 'keycast)
  (require 'keycast)
  (with-eval-after-load 'keycast
    (setopt keycast-mode-line-format "%2s%k%c%2s")
    (fset #'keycast-mode #'pg/keycast-mode)
    (keycast-mode)
    (add-to-list 'global-mode-string '("" keycast-mode-line)))

#+end_src

*** Keybind log package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-keylog.el

  (provide 'pg-keylog)

#+end_src

** Command Completion Framework

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  ;;; pg-completion.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | savehist

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (require 'savehist)
  (with-eval-after-load 'savehist
    (savehist-mode))

#+end_src

*** Package | marginalia

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'marginalia)
  (with-eval-after-load 'vertico
    (require 'marginalia))
  (with-eval-after-load 'marginalia
    (setopt marginalia-annotators '(marginalia-annotators-heavy
                                    marginalia-annotators-light
                                    nil))
    (marginalia-mode))

#+end_src

*** Package | consult

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'consult)
  (unless (fboundp 'consult-line)
    (autoload #'consult-line "consult" nil t))
  (global-set-key (kbd "C-s") #'consult-line)
  (unless (fboundp 'consult-ripgrep)
    (autoload #'consult-ripgrep "consult" nil t))
  (global-set-key (kbd "C-M-s") #'consult-ripgrep)
  (unless (fboundp 'consult-buffer)
    (autoload #'consult-buffer "consult" nil t))
  (global-set-key (kbd "C-x b") #'consult-buffer)
  (with-eval-after-load 'consult
    (setopt consult-buffer-sources '(consult--source-buffer))
    (consult-customize consult-buffer
                       consult-theme
                       :preview-key nil)
    (define-key minibuffer-local-map (kbd "C-r") #'consult-history))

#+end_src

*** Package | orderless

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'orderless)
  (with-eval-after-load 'vertico
    (require 'orderless))
  (with-eval-after-load 'orderless
    (setopt completion-styles '(orderless)
            completion-category-defaults nil
            orderless-skip-highlighting nil
            completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src

*** Package | corfu

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'corfu)
  (unless (fboundp 'corfu-next)
    (autoload #'corfu-next "corfu" nil t))
  (unless (fboundp 'corfu-previous)
    (autoload #'corfu-previous "corfu" nil t))
  (if (boundp 'corfu-map)
      (progn
        (define-key corfu-map (kbd "C-j") #'corfu-next)
        (define-key corfu-map (kbd "C-k") #'corfu-previous))
    (with-eval-after-load 'corfu
      (define-key corfu-map (kbd "C-j") #'corfu-next)
      (define-key corfu-map (kbd "C-k") #'corfu-previous)))
  (unless (fboundp 'corfu-mode)
    (autoload #'corfu-mode "corfu" nil t))
  (with-eval-after-load 'corfu
    (setopt corfu-cycle t))

#+end_src

*** Package | vertico

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'vertico)
  (require 'vertico)
  (unless (fboundp 'vertico-next)
    (autoload #'vertico-next "vertico" nil t))
  (unless (fboundp 'vertico-previous)
    (autoload #'vertico-previous "vertico" nil t))
  (if (boundp 'vertico-map)
      (progn
        (define-key vertico-map (kbd "C-j") #'vertico-next)
        (define-key vertico-map (kbd "C-k") #'vertico-previous))
    (with-eval-after-load 'vertico
      (define-key vertico-map (kbd "C-j") #'vertico-next)
      (define-key vertico-map (kbd "C-k") #'vertico-previous)))
  (with-eval-after-load 'vertico
    (setopt vertico-cycle t)
    (vertico-mode))

#+end_src

*** Package | embark

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'embark)
  (with-eval-after-load 'vertico
    (unless (fboundp 'embark-act)
      (autoload #'embark-act "embark" nil t))
    (global-set-key (kbd "C-S-a") #'embark-act)
    (define-key minibuffer-local-map (kbd "C-d") #'embark-act))
  (with-eval-after-load 'embark
    (setopt embark-confirm-act-all nil)
    (setq embark-action-indicator
          (lambda
            (map)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator))

#+end_src

*** Package | which-key

Displays additional keybindings subsequent to prefix keybindings

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'which-key)
  (require 'which-key)
  (with-eval-after-load 'which-key
    (setopt which-key-idle-delay 1.0)
    (which-key-mode)
    (unless (fboundp 'diminish)
      (autoload #'diminish "diminish" nil t))
    (diminish #'which-key-mode))

#+end_src

*** Package | helm

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'helm)
  (unless (fboundp 'helm-next-line)
    (autoload #'helm-next-line "helm" nil t))
  (unless (fboundp 'helm-previous-line)
    (autoload #'helm-previous-line "helm" nil t))
  (if (boundp 'helm-map)
      (progn
        (define-key helm-map (kbd "C-j") #'helm-next-line)
        (define-key helm-map (kbd "C-k") #'helm-previous-line))
    (with-eval-after-load 'helm
      (define-key helm-map (kbd "C-j") #'helm-next-line)
      (define-key helm-map (kbd "C-k") #'helm-previous-line)))

#+end_src

*** Command completion framework package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-completion.el

  (provide 'pg-completion)

#+end_src

** UI Enhancement

