Emacs.org
*** UI basic settings

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (load-theme 'pg-onedark-variant t) ;; Load onedark theme
  ;; (load-theme 'pg-onelight-variant t) ;; Load onelight theme
  (setq inhibit-startup-message t    ;; Disable startup message
        scroll-conservatively 1000   ;; Slow scrolling
        split-width-threshold 185)   ;; Width for splitting
  (unless pg/is-termux
    (scroll-bar-mode 0)              ;; Disable visible scrollbar
    (tool-bar-mode 0)                ;; Disable toolbar
    (tooltip-mode 0))
  (menu-bar-mode 0)                  ;; Disable menu bar

  ;; Set frame transparency
  (unless (or pg/is-termux (not pg/exwm-enabled))
    (set-frame-parameter nil 'alpha '90)
    (add-to-list 'default-frame-alist '(alpha . 90))
    (set-frame-parameter nil 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

  ;; Set fullscreen
  (if pg/is-windows
      (add-to-list 'default-frame-alist '(fullscreen . maximized)))

#+end_src

*** Package | diminish

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'diminish)
  (require 'diminish)

  (unless (fboundp 'diminish)
    (autoload #'diminish "diminish" nil t))
  (with-eval-after-load 'face-remap
    (diminish #'buffer-face-mode))
  (with-eval-after-load 'simple
    (diminish #'visual-line-mode))
  (with-eval-after-load 'autorevert
    (diminish #'auto-revert-mode))

#+end_src

*** Package | nerd-icons

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'nerd-icons)
  (require 'nerd-icons)

#+end_src

*** Package | doom-modeline

Customizes the look of the modeline for better aesthetic.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (defun pg/strip-file-name (file-path)
    "Strips hashes or dates at the beginning of file names. Presumes they are of
        length 10 at least"
    (let* ((tokens (s-split "/" file-path))
           (dirs (butlast tokens))
           (file-name (car (last tokens))))
      (s-join "/" (append dirs
                          (list (replace-regexp-in-string "^[0-9a-zA-Z]\\{10,\\}-" "...-" file-name))))))

  (straight-use-package 'doom-modeline)
  (require 'doom-modeline)
  (with-eval-after-load 'doom-modeline
    (setopt doom-modeline-height 17
            doom-modeline-modal-icon nil
            doom-modeline-enable-word-count t
            doom-modeline-indent-info t
            doom-modeline-buffer-file-name-function #'pg/strip-file-name
            doom-modeline-buffer-file-name-style 'truncate-except-project
            doom-modeline-mu4e t)
    (doom-modeline-mode 1))

#+end_src

*** Package | dashboard

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (defun pg/dashboard-setup-startup-hook ()
    "Setup post initialization hooks."
    (add-hook 'after-init-hook #'(lambda ()
                                   ;; Display useful lists of items
                                   (dashboard-insert-startupify-lists)))
    (add-hook 'emacs-startup-hook #'(lambda ()
                                      (switch-to-buffer dashboard-buffer-name)
                                      (goto-char (point-min))
                                      (redisplay)
                                      (run-hooks 'dashboard-after-initialize-hook))))

  (defun pg/display-startup-time ()
    "Displays some startip statistics."
    (let ((package-count 0) (time (float-time (time-subtract after-init-time before-init-time))))
      (when (boundp 'straight--profile-cache)
        (setq package-count (+ (hash-table-count straight--profile-cache) package-count)))
      (if (zerop package-count)
          (format "Emacs started in %.2f" time)
        (format "%d packages loaded in %.2f seconds with %d garbage collections" package-count time gcs-done))))

  (add-hook 'dashboard-mode-hook #'(lambda ()
                                     (display-line-numbers-mode 0)))
  (straight-use-package 'dashboard)
  (with-eval-after-load 'projectile
    (require 'dashboard)
    (fset #'dashboard-setup-startup-hook #'pg/dashboard-setup-startup-hook))
  (setopt dashboard-items '((recents . 5)
                            (projects . 5)
                            (agenda . 5))
          dashboard-set-heading-icons t
          dashboard-projects-backend 'projectile
          dashboard-set-file-icons t
          dashboard-display-icons-p t
          dashboard-match-agenda-entry "task"
          dashboard-page-separator "\n\f\n"
          dashboard-init-info #'pg/display-startup-time)
  (with-eval-after-load 'dashboard
    (pg/dashboard-setup-startup-hook))

#+end_src

*** Package | page-break-lines

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'page-break-lines)
  (require 'page-break-lines)

#+end_src

*** UI enhancement package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-ui.el

  (provide 'pg-ui)

#+end_src

** Window Management

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  ;;; pg-buffer.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Window basic management

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (setq even-window-sizes nil
        display-buffer-base-action
        '(display-buffer-reuse-mode-window
          display-buffer-reuse-window
          display-buffer-same-window))

#+end_src

*** Package | bufler

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (straight-use-package 'bufler)
  (unless (fboundp 'bufler)
    (autoload #'bufler "bufler" nil t))
  (global-set-key (kbd "C-x C-b") #'bufler)
  (with-eval-after-load 'bufler
    (unless (fboundp 'evil-collection-define-key)
      (autoload #'evil-collection-define-key "evil-collection"))
    (evil-collection-define-key 'normal 'bufler-list-mode-map
      (kbd "RET") #'bufler-list-buffer-switch
      (kbd "M-RET") #'bufler-list-buffer-peek
      "D" #'bufler-list-buffer-kill))

#+end_src

*** Package | winner-mode

For window configurations

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (require 'winner)
  (with-eval-after-load 'winner
    (winner-mode)
    (with-eval-after-load 'general
      (pg/leader-keys
        "wu" '(winner-undo :which-key "undo config")
        "wr" '(winner-redo :which-key "redo config"))))

#+end_src

*** Package | tab-bar

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (require 'tab-bar)
  (with-eval-after-load 'tab-bar
    (setopt tab-bar-show 1)
    (tab-bar-mode)
    (with-eval-after-load 'general
      (pg/leader-keys
        "wt" '(:ignore t :which-key "tabs")
        "wtt" '(tab-new :which-key "create")
        "wtw" '(tab-close :which-key "close")
        "wtr" '(tab-rename :which-key "name")
        "wts" '(tab-switch :which-key "switch")
        "wtu" '(tab-undo :which-key "undo"))))

#+end_src

*** Package | perspective

For organizing the buffer list

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (straight-use-package 'perspective)
  (require 'perspective)
  (with-eval-after-load 'perspective
    (setopt persp-suppress-no-prefix-key-warning t)
    (global-set-key (kbd "C-x k") #'persp-kill-buffer*)
    (unless (equal persp-mode t)
      (persp-mode))
    (with-eval-after-load 'general
      (pg/leader-keys
        "wp" '(:ignore t :which-key "persp")
        "wpc" '(persp-switch :which-key "create")
        "wps" '(hydra-perspective-switch/body :which-key "switch")
        "wpa" '(persp-add-buffer :which-key "add buf")
        "wpu" '(persp-set-buffer :which-key "set buf")
        "wpk" '(persp-kill :which-key "remove"))))

#+end_src

*** Window management package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-buffer.el

  (provide 'pg-buffer)

#+end_src

** Email Management

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-email.el

  ;;; pg-email.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

