.emacs.d/lisp/pg-email.el
;;; pg-email.el -*- lexical-binding: t; -*-
;; Author: Philippe Gabriel

(unless (or pg/is-termux
            pg/is-windows)
