.emacs.d/lisp/pg-editing.el
;;; pg-editing.el -*- lexical-binding: t; -*-
;; Author: Philippe Gabriel

(setq tab-width 4                     ;; Set tab length
      custom-buffer-indent 2
      display-line-numbers-type 'relative)
(setq-default indent-tabs-mode nil    ;; Disable tab caracter
              fill-column 80)         ;; 80 caracter column indicator
(show-paren-mode 1)                   ;; Enable delimiters matching
(save-place-mode 1)                   ;; Remembers last cursor placement in file
(column-number-mode)                  ;; Show column numbers
(mouse-avoidance-mode 'banish)        ;; No mouse allowed
(global-display-line-numbers-mode 1)  ;; Show line numbers
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
(require 'ansi-color)
(add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)

(dolist (mode '(compilation-mode-hook
                Man-mode-hook
                comint-mode-hook
                etc-authors-mode-hook))
  (add-hook mode #'(lambda ()
                     (display-line-numbers-mode 0))))

(set-face-attribute 'default nil :font (plist-get pg/user :font-fixed) :weight 'light :height 120)
(set-face-attribute 'fixed-pitch nil :family (plist-get pg/user :font-fixed) :weight 'light)
(set-face-attribute 'variable-pitch nil :family (plist-get pg/user :font-variable) :weight 'regular)
