Emacs.org
*** Editing experience package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-editing.el

  (provide 'pg-editing)

#+end_src

** Help Documentation

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-help.el

  ;;; pg-help.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | helpful

Displays full documentations in place of the default help function.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-help.el

  (add-hook 'helpful-mode-hook #'(lambda ()
                                   (display-line-numbers-mode 0)))
  (straight-use-package 'helpful)
  (unless (fboundp 'helpful-callable)
    (autoload #'helpful-callable "helpful" nil t))
  (global-set-key [remap describe-function] #'helpful-callable)
  (unless (fboundp 'helpful-command)
    (autoload #'helpful-command "helpful" nil t))
  (global-set-key [remap describe-command] #'helpful-command)
  (unless (fboundp 'helpful-variable)
    (autoload #'helpful-variable "helpful" nil t))
  (global-set-key [remap describe-variable] #'helpful-variable)
  (unless (fboundp 'helpful-key)
    (autoload #'helpful-key "helpful" nil t))
  (global-set-key [remap describe-key] #'helpful-key)
  (unless (fboundp 'helpful-symbol)
    (autoload #'helpful-symbol "helpful" nil t))
  (global-set-key [remap describe-symbol] #'helpful-symbol)
  (with-eval-after-load 'general
    (pg/leader-keys
      "h" '(:ignore t :which-key "help")
      "hk" '(helpful-key :which-key "key")
      "hf" '(helpful-callable :which-key "command")
      "hv" '(helpful-variable :which-key "variable")
      "hb" '(describe-bindings :which-key "bindings")
      "hc" '(describe-face :which-key "face")
      "hp" '(describe-package :which-key "package")
      "hk" '(helpful-kill-buffers :which-key "quit")))

#+end_src

*** Package | Info

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-help.el

  (defun pg/Info-mode-setup ()
    "Defining some behaviours for the major info-mode."
    (auto-fill-mode 0)
    (display-line-numbers-mode 0)
    (setq-local face-remapping-alist '((default (:height 1.5) default)
                                       (info-menu-header (:height 1.5) info-menu-header)
                                       (info-title-1 (:height 1.05) info-title-1)
                                       (info-title-2 (:height 1.15) info-title-2)
                                       (info-title-3 (:height 1.15) info-title-3)
                                       (info-title-4 (:height 2.0) info-title-4)))
    (variable-pitch-mode 1)
    (visual-line-mode 1))
  (add-hook 'Info-mode-hook #'pg/Info-mode-setup)

#+end_src

*** Package | visual-fill-column

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-help.el

  (straight-use-package 'visual-fill-column)
  (unless (fboundp 'visual-fill-column-mode)
    (autoload #'visual-fill-column-mode "visual-fill-column" nil t))
  (dolist (mode '(org-mode-hook
                  gfm-view-mode-hook
                  elfeed-show-mode-hook
                  mu4e-view-mode-hook
                  nov-mode-hook
                  Info-mode-hook
                  eww-mode-hook))
    (add-hook mode #'(lambda ()
                       (visual-fill-column-mode 1))))
  (with-eval-after-load 'visual-fill-column
    (setopt visual-fill-column-width 150
            visual-fill-column-center-text t))

#+end_src

*** Help documentation package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-help.el

  (provide 'pg-help)

#+end_src

** Web Design

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-web.el

  ;;; pg-web.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | eww

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-web.el

  (defun pg/eww-mode-setup ()
    (auto-fill-mode 0)
    (display-line-numbers-mode 0)
    (visual-line-mode 1)
    (setq-local face-remapping-alist '((default (:height 1.5) default))))
  (add-hook 'eww-mode-hook #'pg/eww-mode-setup)

#+end_src

*** Web design package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-web.el

  (provide 'pg-web)

#+end_src

** File management

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  ;;; pg-file.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Temporary Files Management and Symlinks

Some settings to manage where emacs stores backup files (such as the =~= backup files).

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (setopt backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory)))
          enable-remote-dir-locals t
          auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t))
          vc-follow-symlinks t)

#+end_src

*** Package | dired

The built-in directory editor. Some basic useful keybindings to keep in mind:
- ~j~ / ~k~ - Next / Previous line
- ~J~ - Jump to file in buffer
- ~RET~ - Select file or directory
- ~^~ - Go to parent directory
- ~g O~ - Open file in other window
- ~g o~ - Open file in other window in preview mode, which can be closed with ~q~
- ~M-RET~ - Show file in other window without focusing (previewing)

Keybindings relative to marking (selecting) in dired:
- ~m~ - Marks a file
- ~u~ - Unmarks a file
- ~U~ - Unmarks all files in buffer
- ~t~ - Inverts marked files in buffer
- ~% m~ - Mark files in buffer using regular expression
- ~*~ - Lots of other auto-marking functions
- ~K~ - "Kill" marked items, removed from the view only (refresh buffer with ~g r~ to get them back)
Many operations can be done on a single file if there are no active marks.

Keybindings relative to copying and renaming files:
- ~C~ - Copy marked files (or if no files are marked, the current file)
- ~R~ - Rename marked files
- ~% R~ - Rename based on regular expression

Keybindings relative to deleting files:
- ~D~ - Delete marked file
- ~d~ - Mark file for deletion
- ~x~ - Execute deletion for marks
- ~delete-by-moving-to-trash~ - Move to trash instead of deleting permanently if set to true

Keybindings relative to archives and compressing:
- ~Z~ - Compress or uncompress a file or folder to (.tar.gz)
- ~c~ - Compress selection to a specific file
- ~dired-compress-files-alist~ - Bind compression commands to file extension by adding additional extensions to the list

Keybindings for other useful operations:
- ~T~ - Touch (change timestamp)
- ~M~ - Change file mode
- ~O~ - Change file owner
- ~G~ - Change file group
- ~S~ - Create a symbolic link to this file
- ~L~ - Load an Emacs Lisp file into Emacs
  
#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (unless (fboundp 'dired)
    (autoload #'dired "dired" nil t))
  (unless (fboundp 'dired-jump)
    (autoload #'dired-jump "dired" nil t))
  (global-set-key (kbd "C-x C-j") #'dired-jump)
  (with-eval-after-load 'dired
    (setopt dired-listing-switches "-Alh --group-directories-first"))

#+end_src

*** Package | dired-single

Keeps a single dired buffer open at a time (to not have multiple buried buffers).

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (straight-use-package 'dired-single)
  (with-eval-after-load 'dired
    (require 'dired-single))
  (with-eval-after-load 'dired-single
    (if (boundp 'dired-mode-map)
        (progn
          (define-key dired-mode-map [remap dired-find-file] 'dired-single-buffer)
          (define-key dired-mode-map [remap dired-mouse-find-file-other-window] 'dired-single-buffer-mouse)
          (define-key dired-mode-map [remap dired-up-directory] 'dired-single-up-directory)))
    (unless (fboundp 'evil-collection-define-key)
      (autoload #'evil-collection-define-key "evil-collection"))
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" #'dired-single-up-directory
      "l" #'dired-single-buffer))

#+end_src

*** Package | nerd-icons-dired

Displays icons in dired-mode.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (straight-use-package 'nerd-icons-dired)
  (unless pg/is-termux
    (unless (fboundp 'nerd-icons-dired-mode)
      (autoload #'nerd-icons-dired-mode "nerd-icons-dired" nil t))
    (add-hook 'dired-mode-hook #'nerd-icons-dired-mode))

#+end_src

*** Package | dired-hide-dotfiles

Togglable option for hiding dot files.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (straight-use-package 'dired-hide-dotfiles)
  (with-eval-after-load 'dired
    (unless (fboundp 'dired-hide-dotfiles-mode)
      (autoload #'dired-hide-dotfiles-mode "dired-hide-dotfiles" nil t))
    (add-hook 'dired-mode-hook #'dired-hide-dotfiles-mode)
    (with-eval-after-load 'evil-collection
      (evil-collection-define-key 'normal 'dired-mode-map
        "H" #'dired-hide-dotfiles-mode)))

#+end_src

*** Package | openwith

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (unless pg/is-termux
    (straight-use-package 'openwith)
    (when (require 'openwith nil 'noerror)
      (setopt large-file-warning-threshold nil
              openwith-associations `((,(openwith-make-extension-regexp '("mpg"
                                                                          "mpeg"
                                                                          "mp4"
                                                                          "avi"
                                                                          "wmv"
                                                                          "mov"
                                                                          "flv"
                                                                          "ogm"
                                                                          "ogg"
                                                                          "mkv"))
                                       "mpv"
                                       (file))
                                      (,(openwith-make-extension-regexp '("odt"
                                                                          "ods"))
                                       "libreoffice"
                                       (file))
                                      (,(openwith-make-extension-regexp '("xopp"))
                                       "xournalpp"
                                       (file)))))
    (openwith-mode 1))

#+end_src

*** Package | subed

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (straight-use-package 'subed)
  (with-eval-after-load 'subed
    (dolist (mode #'(save-place-local-mode
                     turn-on-auto-fill))
      (add-hook 'subed-mode-hook mode)))

#+end_src

*** File management package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-file.el

  (provide 'pg-file)

#+end_src

** Shell customization

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  ;;; pg-shell.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | eshell-git-prompt

Adds more detail to the prompt in eshell with custome themes.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (straight-use-package 'eshell-git-prompt)
  (with-eval-after-load 'eshell
    (require 'eshell-git-prompt))
  (with-eval-after-load 'eshell-git-prompt
    (eshell-git-prompt-use-theme 'multiline2))

#+end_src

*** Package | eshell-syntax-highlighting

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (straight-use-package 'eshell-syntax-highlighting)
  (with-eval-after-load 'eshell
    (require 'eshell-syntax-highlighting))
  (with-eval-after-load 'eshell-syntax-highlighting
    (setopt eshell-syntax-highlighting-global-mode t))

#+end_src

*** Package | esh-autosuggest

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (straight-use-package 'esh-autosuggest)
  (with-eval-after-load 'eshell
    (unless (fboundp 'esh-autosuggest-mode)
      (autoload #'esh-autosuggest-mode "esh-autosuggest" nil t))
    (add-hook 'eshell-mode-hook #'esh-autosuggest-mode))
  (with-eval-after-load 'esh-autosuggest
    (setopt esh-autosuggest-delay 0.5))

#+end_src

*** Package | eshell

Some configurations to the built-in eshell.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (defun pg/configure-eshell ()
    "Eshell setup."
    (with-eval-after-load 'evil
      (evil-define-key '(normal insert visual) eshell-mode-map
        (kbd "<home>") #'eshell-bol)
      (evil-normalize-keymaps))

    (with-eval-after-load 'corfu
      (corfu-mode))

    (require 'em-hist)
    (with-eval-after-load 'em-hist
      (setopt eshell-history-size 10000
              eshell-hist-ignoredups t)
      (require 'esh-cmd)
      (with-eval-after-load 'esh-cmd
        (add-hook 'eshell-pre-command-hook #'eshell-save-some-history)))

    (require 'esh-mode)
    (with-eval-after-load 'esh-mode
      (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
      (setopt eshell-buffer-maximum-lines 10000
              eshell-scroll-to-bottom-on-input 'all)))

  (add-hook 'eshell-mode-hook #'(lambda ()
                                  (display-line-numbers-mode 0)))
  (require 'esh-mode)
  (with-eval-after-load 'esh-mode
    (add-hook 'eshell-first-time-mode-hook #'pg/configure-eshell))
  (unless (fboundp 'eshell)
    (autoload #'eshell "eshell" nil t))
  (with-eval-after-load 'eshell
    (require 'em-tramp)
    (setopt eshell-prefer-lisp-functions t))
  (with-eval-after-load 'general
    (pg/leader-keys
      "pe" '(eshell :which-key "eshell")))

#+end_src

*** Package | vterm

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (unless pg/is-guix-system
    (straight-use-package 'vterm))
  (unless (fboundp 'vterm)
    (autoload #'vterm "vterm" nil t))
  (add-hook 'vterm-mode-hook #'(lambda ()
                                 (display-line-numbers-mode 0)))
  (with-eval-after-load 'vterm
    (setopt vterm-tramp-shells `(("ssh" ,(executable-find "sh")))))
  (with-eval-after-load 'general
    (pg/leader-keys
      "pv" '(vterm :which-key "vterm")))

#+end_src

*** Shell customization package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-shell.el

  (provide 'pg-shell)

#+end_src

** Project Management and Version Control

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-project.el

  ;;; pg-project.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

