.emacs.d/lisp/pg-editing.el

(provide 'pg-editing)
