Emacs.org
***** Package | arduino-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-arduino.el

  (unless (or pg/is-termux
              pg/is-windows)
    (defconst sketch-bare-minimum
      (concat "/**\n * @author Philippe Gabriel\n */\n\n"
              "void setup() {\n  // put your setup code here, to run once:\n}\n\n"
              "void loop() {\n  // put your main code here, to run repeatedly:\n}")
      "Arduino sketches bare minimum code.")

    (defun pg/arduino-serial-monitor ()
      "Opens the Arduino Serial Monitor."
      (interactive)
      (switch-to-buffer-other-window (buffer-name))
      (arduino-serial-monitor "/dev/ttyACM0" 9600))

    (defun pg/arduino-sketch-new (sketch)
      "Creates a new Arduino Sketch."
      (interactive (list (read-from-minibuffer "Arduino new sketch file: ")))
      (unless (featurep 'arduino-mode)
        (require 'arduino-mode))
      (let* ((sketch-dir (concat arduino-mode-home "Sketches/code/" sketch))
             (sketch-file (concat sketch-dir "/" sketch ".ino")))
        (make-directory sketch-dir)
        (write-region sketch-bare-minimum nil sketch-file nil nil nil t)
        (find-file sketch-file)))

    (straight-use-package 'arduino-mode)
    (unless (fboundp 'flycheck-arduino-setup)
      (autoload #'flycheck-arduino-setup "flycheck-arduino" nil t))
    (add-hook 'arduino-mode-hook #'flycheck-arduino-setup)
    (with-eval-after-load 'arduino-mode
      (setopt arduino-executable (concat (plist-get pg/user :home) "/bin/arduino-flat")
              arduino-mode-home (concat (plist-get pg/user :home) "/Workspace/Arduino/"))
      (define-key arduino-mode-map (kbd "C-c RET") #'pg/arduino-serial-monitor)
      (with-eval-after-load 'lsp-mode
        (add-to-list 'lsp-language-id-configuration '(arduino-mode . "arduino"))
        (lsp-register-client
         (make-lsp--client
          :new-connection (lsp-stdio-connection `("arduino-language-server"
                                                  ;; "-clangd" ,(concat (getenv "GUIX_EXTRA_PROFILES") "cc/cc/bin/clangd")
                                                  "-cli" ,(concat (plist-get pg/user :home) "/Packages/arduino-cli")
                                                  "-cli-config" ,(concat (plist-get pg/user :home) "/.arduino15/arduino-cli.yaml")
                                                  "-fqbn" "arduino:avr:uno"))
          :major-modes '(arduino-mode)
          :server-id 'arduino)))))

#+end_src

***** Package | company-arduino

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-arduino.el

  (unless (or pg/is-termux
              pg/is-windows)
    (straight-use-package 'company-arduino)
    (add-hook 'irony-mode-hook 'company-arduino-turn-on)
    (unless (fboundp 'irony-mode)
      (autoload #'irony-mode "irony" nil t))
    (add-hook 'arduino-mode-hook 'irony-mode)
    (setq company-arduino-sketch-directory-regex (concat (plist-get pg/user :home) "/Workspace/Arduino")))

#+end_Src

***** Arduino package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-arduino.el

  (provide 'pg-programming-arduino)

#+end_src

**** C/C++/Objective-C

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  ;;; pg-programming-cc.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | cc-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  ;; TODO: Get guix shell path with direnv
  (with-eval-after-load 'cc-mode
    (setopt company-clang-executable (concat (getenv "GUIX_EXTRA_PROFILES") "/cc/cc/bin/clang")))

#+end_src

***** Package | cc-vars

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  (with-eval-after-load 'cc-mode
    (require 'cc-vars))
  (with-eval-after-load 'cc-vars
    (setopt c-basic-offset 4))

#+end_src

***** Package | company-c-headers

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  ;; TODO: Find fix with direnv
  (defun pg/company-c-headers-get-system-path ()
    "Return the system include path for the current buffer."
    (let ((default `(,(expand-file-name "~/.guix-extra-profiles/cc/cc/include/"))))
      (company-arduino-append-include-dirs default t)))

  (straight-use-package 'company-c-headers)
  (with-eval-after-load 'company
    (with-eval-after-load 'cc-mode
      (require 'company-c-headers)))
  (with-eval-after-load 'company-c-headers
    (setopt company-c-headers-path-system 'pg/company-c-headers-get-system-path)
    (add-to-list 'company-backends '(company-c-headers :with company-yasnippet)))

#+end_src

***** Package | ccls

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  (straight-use-package 'ccls)
  (with-eval-after-load 'cc-mode
    (with-eval-after-load 'lsp-mode
      (require 'ccls)))
  (dolist (mode '(c-mode-hook
                  c++-mode-hook
                  objc-mode-hook))
    (add-hook mode #'lsp-deferred))

#+end_src

***** Package | irony

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  (straight-use-package 'irony)
  (dolist (mode '(c-mode-hook
                  c++-mode-hook
                  objc-mode-hook))
    (add-hook mode #'irony-mode))
  (add-hook 'irony-mode-hook #'irony-cdb-autosetup-compile-options)

#+end_src

***** Package | company-irony

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  (straight-use-package 'company-irony)

#+end_src

***** C languages package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-cc.el

  (provide 'pg-programming-cc)

#+end_src

**** Clojure

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-clojure.el

  ;;; pg-programming-clojure.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | clojure-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-clojure.el

  (straight-use-package 'clojure-mode)
  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (add-hook 'clojure-mode-hook #'lsp-deferred)

#+end_src

***** Clojure package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-clojure.el

  (provide 'pg-programming-clojure)

#+end_src

**** Common Lisp

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-commonlisp.el

  ;;; pg-programming-commonlisp.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | sly

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-commonlisp.el

  (straight-use-package 'sly)
  (unless (fboundp 'sly)
    (autoload #'sly "sly" nil t))
  (with-eval-after-load 'sly
    (setopt inferior-lisp-program "sbcl"))

#+end_src

***** Common lisp package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-commonlisp.el

  (provide 'pg-programming-commonlisp)

#+end_src

**** Css

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-css.el

  ;;; pg-programming-css.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | css-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-css.el

  (with-eval-after-load 'css-mode
    (setopt css-indent-offset 2))

#+end_src

***** Package | lsp-css

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-css.el

  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (dolist (mode '(css-mode-hook
                  less-css-mode-hook
                  scss-mode-hook))
    (add-hook mode #'lsp-deferred))

#+end_src

***** Css package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-css.el

  (provide 'pg-programming-css)

#+end_src

**** Docker

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-docker.el

  ;;; pg-programming-docker.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | docker

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-docker.el

  (straight-use-package 'docker)
  (add-to-list 'auto-mode-alist
               (cons (concat "[/\\]"
                             "\\(?:Containerfile\\|Dockerfile\\)"
                             "\\(?:\\.[^/\\]*\\)?\\'")
                     'dockerfile-ts-mode))
  (add-hook 'dockerfile-ts-mode-hook #'lsp-deferred)

#+end_src

***** Docker package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-docker.el

  (provide 'pg-programming-docker)

#+end_src

**** Emacs Lisp

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-elisp.el

  ;;; pg-programming-elisp.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | ielm

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-elisp.el

  (unless (fboundp 'corfu-mode)
    (autoload #'corfu-mode "corfu" nil t))
  (add-hook 'ielm-mode-hook #'corfu-mode)
  (add-hook 'ielm-mode-hook #'(lambda ()
                                (display-line-numbers-mode 0)))

#+end_src

***** Emacs Lisp Package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-elisp.el

  (provide 'pg-programming-elisp)

#+end_src

**** Erlang

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-erlang.el

  ;;; pg-programming-erlang.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | erlang

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-erlang.el

  (straight-use-package 'erlang)
  (add-hook 'erlang-mode-hook #'lsp-deferred)

#+end_src

***** Erlang Package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-erlang.el

  (provide 'pg-programming-erlang)

#+end_src

**** GDScript
***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-gdscript.el

  ;;; pg-programming-gdscript.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | gdscript-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-gdscript.el

  (straight-use-package 'gdscript-mode)
  (setopt lsp-gdscript-port 6008
          gdscript-use-tab-indents nil)

#+end_src

***** GDScript Package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-gdscript.el

  (provide 'pg-programming-gdscript)

#+end_src

**** Git

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-git.el

  ;;; pg-programming-git.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | git-modes

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-git.el

  (straight-use-package 'git-modes)

#+end_src

***** Git Package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-git.el

  (provide 'pg-programming-git)

#+end_src

**** Groovy
***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-groovy.el

  ;;; pg-programming-groovy.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

