Emacs.org
***** Package | groovy-emacs-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-groovy.el

  (straight-use-package '(groovy-emacs-modes :type git
                                             :host github
                                             :repo "Groovy-Emacs-Modes/groovy-emacs-modes"))

#+end_src

***** Groovy Package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-groovy.el

  (provide 'pg-programming-groovy)

#+end_src

**** Haskell

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-haskell.el

  ;;; pg-programming-haskell.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | haskell-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-haskell.el

  (add-hook 'inferior-haskell-mode-hook #'(lambda ()
                                            (display-line-numbers-mode 0)))
  (straight-use-package 'haskell-mode)
  (with-eval-after-load 'haskell-mode
    (setopt haskell-process-type 'ghci))

#+end_src

***** Haskell package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-haskell.el

  (provide 'pg-programming-haskell)

#+end_src

**** HTML

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-html.el

  ;;; pg-programming-html.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | mhtml-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-html.el

  (add-hook 'mhtml-mode-hook #'lsp-deferred)

#+end_src

***** Package | web-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-html.el

  (straight-use-package 'web-mode)
  (setopt web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-markup-indent-offset 2
          web-mode-markup-comment-indent-offset 2
          web-mode-enable-curly-brace-indentation t)

#+end_src

***** HTML package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-html.el

  (provide 'pg-programming-html)

#+end_src

**** I3wm Config

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-i3config.el

  ;;; pg-programming-i3config.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | i3wm-Config-Mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-i3config.el

  (straight-use-package 'i3wm-config-mode)
  (unless (fboundp 'i3wm-config-mode)
    (autoload #'i3wm-config-mode "i3wm-config-mode" nil t))

#+end_src

***** I3wm Config package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-i3config.el

  (provide 'pg-programming-i3config)

#+end_src

**** Java

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-java.el

  ;;; pg-programming-java.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | lsp-java

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-java.el

  (defun pg/spring-boot-properties ()
    "Makes appropriate calls when opening a spring properties file."
    (when (not (equal nil (string-match-p "application\\(-?[^-]+\\)?\\.properties"
                                          (file-name-nondirectory (buffer-file-name)))))
      (progn (run-hooks 'prog-mode-hook)
             (lsp-deferred))))

  (straight-use-package 'lsp-java)
  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (add-hook 'java-mode-hook #'lsp-deferred)
  (unless (fboundp 'lsp-java-boot-lens-mode)
    (autoload #'lsp-java-boot-lens-mode "lsp-java-boot" nil t))
  (add-hook 'java-mode-hook #'lsp-java-boot-lens-mode)
  (with-eval-after-load 'lsp-mode
    (require 'lsp-java))
  (with-eval-after-load 'lsp-java
    (add-hook 'find-file-hook #'pg/spring-boot-properties)
    (dolist (feature '(dap-java
                       lsp-java-boot))
      (require feature))
    (define-key lsp-mode-map (kbd "C-<return>") #'lsp-execute-code-action)
    (setopt lsp-java-configuration-runtimes `[( :name "JavaSE-17"
                                                :path ,(getenv "JAVA_HOME")
                                                :default t)]
            lsp-java-vmargs (list "-noverify" "-Xmx1G" "-XX:+UseG1GC" "-XX:+UseStringDeduplication" "--enable-preview")
            lsp-java-java-path "java"
            lsp-java-import-gradle-java-home (getenv "JAVA_HOME")))

#+end_src

***** Java package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-java.el

  (provide 'pg-programming-java)

#+end_src

**** Javascript

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-javascript.el

  ;;; pg-programming-javascript.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | js

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-javascript.el

  (add-hook 'js-mode-hook #'lsp-deferred)
  (unless (fboundp 'javascript-mode)
    (autoload #'javascript-mode "js" nil t))
  (with-eval-after-load 'js
    (setopt js-indent-level 2))

#+end_src

***** Javascript package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-javascript.el

  (provide 'pg-programming-javascript)

#+end_src

**** JSON

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-json.el

  ;;; pg-programming-json.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | json-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-json.el

  (straight-use-package 'json-mode)

#+end_src

***** JSON package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-json.el

  (provide 'pg-programming-json)

#+end_src

**** LaTeX

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-tex.el

  ;;; pg-programming-tex.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | auctex

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-tex.el

  (straight-use-package 'auctex)
  (add-hook 'TeX-mode-hook #'(lambda nil (run-hooks 'prog-mode-hook)))
  (unless (fboundp 'TeX-revert-document-buffer)
    (autoload #'TeX-revert-document-buffer "tex-mode" nil t))
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  (unless (fboundp 'latex-mode)
    (autoload #'latex-mode "tex-mode" nil t))
  (add-to-list 'auto-mode-alist '("\\.tex\\'" . latex-mode))
  (with-eval-after-load 'tex
    (setopt latex-run-command "pdflatex"
            TeX-view-program-selection '((output-pdf "PDF Tools"))
            TeX-source-correlate-start-server t)
    (put 'tex-mode 'derived-mode-parent 'prog-mode))

#+end_src

***** Package | company-auctex

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-tex.el

  (straight-use-package 'company-auctex)

#+end_src

***** LaTeX package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-tex.el

  (provide 'pg-programming-tex)

#+end_src

**** LMC

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-lmc.el

  ;;; pg-programming-lmc.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | lmc-java

Custom syntax highlighting for LMC assembly language.
      
#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-lmc.el

  (defvar lmc-java-mode-hook nil)

  (add-to-list 'auto-mode-alist '("\\.lmc\\'" . lmc-java-mode))

  (defconst lmc-java-font-lock-defaults
    (list
     '("#.*" . font-lock-comment-face)
     '("\\<\\(ADD\\|BR[PZ]?\\|DAT\\|HLT\\|IN\\|LDA\\|OUT\\|S\\(?:TO\\|UB\\)\\)\\>" . font-lock-keyword-face)
     '("^\\w+" . font-lock-function-name-face)
     '("\\b[0-9]+\\b" . font-lock-constant-face))
    "Minimal highlighting expressions for lmc mode")

  (defvar lmc-java-mode-syntax-table
    (let ((st (make-syntax-table)))
      (modify-syntax-entry ?# ". 1b" st)
      (modify-syntax-entry ?\n "> b" st)
      st)
    "Syntax table for lmc-mode")

  (define-derived-mode lmc-java-mode prog-mode "LMC"
    "Major mode for editing lmc files"
    :syntax-table lmc-java-mode-syntax-table

    (set (make-local-variable 'font-lock-defaults) '(lmc-java-font-lock-defaults))

    (setq-local comment-start "# "
                comment-end ""
                indent-tabs-mode nil))

#+end_src

***** Lmc package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-lmc.el

  (provide 'pg-programming-lmc)

#+end_src

**** Markdown

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-markdown.el

  ;;; pg-programming-markdown.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | markdown-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-markdown.el

  (straight-use-package 'markdown-mode)
  (add-hook 'gfm-view-mode-hook (lambda ()
                                  (display-line-numbers-mode 0)
                                  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                                                     (markdown-code-face (:height 1.0) org-code)))))
  (with-eval-after-load 'markdown-mode
    (dolist (face '((markdown-header-face-1 . 1.9)
                    (markdown-header-face-2 . 1.7)
                    (markdown-header-face-3 . 1.5)
                    (markdown-header-face-4 . 1.3)
                    (markdown-header-face-5 . 1.1)
                    (markdown-header-face-6 . 1.05)))
      (set-face-attribute (car face) nil :weight 'regular :height (cdr face))))

#+end_src

***** Markdown package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-markdown.el

  (provide 'pg-programming-markdown)

#+end_src

**** MIPS

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-mips.el

  ;;; pg-programming-mips.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | mips-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-mips.el

  (straight-use-package 'mips-mode)
  (unless (fboundp 'mips-mode)
    (autoload #'mips-mode "mips-mode" nil t))
  (add-to-list 'auto-mode-alist '("\\.asm\\'" . mips-mode))
  (with-eval-after-load 'mips-mode
    (setopt mips-tab-width 4))

#+end_src

***** Mips package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-mips.el

  (provide 'pg-programming-mips)

#+end_src

**** PHP

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-php.el

  ;;; pg-programming-php.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | php-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-php.el

  (straight-use-package 'php-mode)
  (setopt php-mode-lineup-cascaded-calls t)

#+end_src

***** PHP package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-php.el

  (provide 'pg-programming-php)

#+end_src

**** Prolog

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-prolog.el

    ;;; pg-programming-prolog.el -*- lexical-binding: t; -*-

#+end_src

***** Package | prolog

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-prolog.el

  (add-hook 'prolog-inferior-mode-hook #'(lambda ()
                                           (display-line-numbers-mode 0)))
  (unless (fboundp 'prolog-mode)
    (autoload #'prolog-mode "prolog" nil t))

#+end_src

***** Prolog package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-prolog.el

  (provide 'pg-programming-prolog)

#+end_src

**** Python

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  ;;; pg-programming-python.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

