Emacs.org
***** Package | python

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (defun pg/run-ipython ()
    "Runs an inferior iPython process."
    (interactive)
    (when (executable-find "ipython")
      (ansi-term "ipython")))

  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (add-hook 'python-ts-mode-hook #'lsp-deferred)
  (add-hook 'inferior-python-mode-hook #'corfu-mode)
  (add-hook 'inferior-python-mode-hook #'(lambda ()
                                           (display-line-numbers-mode 0)))

  (with-eval-after-load 'python
    (setopt python-fill-docstring-style 'django
            python-shell-virtualenv-root (concat (plist-get pg/user :home) "/.conda/envs")
            python-indent-offset 4)
    (define-key python-mode-map (kbd "C-c C-i") #'pg/run-ipython)
    (define-key inferior-python-mode-map (kbd "TAB") #'complete-symbol))

#+end_src

***** Package | conda

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (straight-use-package 'conda)
  (when (executable-find "conda")
    (add-hook'conda-postactivate-hook #'(lambda ()
                                          (setenv "OLD_JUPYTER_PATH" (getenv "JUPYTER_PATH"))
                                          (if (null (getenv "JUPYTER_PATH"))
                                              (setenv "JUPYTER_PATH" (concat conda-env-current-path "lib"))
                                            (setenv "JUPYTER_PATH" (concat (getenv "JUPYTER_PATH") ":" conda-env-current-path "lib")))))
    (add-hook 'conda-predeactivate-hook #'(lambda ()
                                            (setenv "JUPYTER_PATH" (getenv "OLD_JUPYTER_PATH"))
                                            (setenv "JUPYTER_PATH")))
    (setopt conda-anaconda-home (concat (plist-get pg/user :guix-home-profile))
            conda-env-home-directory (concat (plist-get pg/user :home) "/.conda")
            conda-env-subdirectory "envs")
    (unless (getenv "CONDA_DEFAULT_ENV")
      (conda-env-activate "ml_practice"))
    (with-eval-after-load 'conda
      (conda-env-initialize-interactive-shells)
      (conda-env-initialize-eshell)))

#+end_src

***** Package | lsp-pyright

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (straight-use-package 'lsp-pyright)
  (with-eval-after-load 'python
    (with-eval-after-load 'lsp-mode
      (require 'lsp-pyright)))

  (with-eval-after-load 'lsp-pyright
    (setopt lsp-pyright-venv-path (concat (plist-get pg/user :home) "/.conda/envs")
            lsp-pyright-venv-directory "envs"))

#+end_src

***** Package | dap-python

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (with-eval-after-load 'python
    (with-eval-after-load 'lsp-mode
      (require 'dap-python)))
  (with-eval-after-load 'dap-python
    (setopt dap-python-debugger 'debugpy))

#+end_src

***** Package | jupyter

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (defun pg/jupyter-refresh-kernelspecs ()
    "Refresh Jupyter kernelspecs"
    (interactive)
    (jupyter-available-kernelspecs t))

  (unless pg/is-windows
    (straight-use-package 'jupyter)
    (add-hook 'jupyter-repl-mode-hook #'company-mode)
    (add-hook 'jupyter-repl-mode-hook #'(lambda ()
                                          (display-line-numbers-mode 0)
                                          (require 'jupyter))))

#+end_src

***** Python package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-python.el

  (provide 'pg-programming-python)

#+end_src

**** Scala

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-scala.el

  ;;; pg-programming-scala.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | scala-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-scala.el

  (straight-use-package 'scala-mode)
  (unless (fboundp 'scala-mode)
    (autoload #'scala-mode "scala-mode" nil t))
  (add-to-list 'interpreter-mode-alist '("scala" . scala-mode))

#+end_src

***** Package | sbt-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-scala.el

  (straight-use-package 'sbt-mode)
  (unless (fboundp 'sbt-start)
    (autoload #'sbt-start "sbt-mode" nil t))
  (unless (fboundp 'sbt-command)
    (autoload #'sbt-command "sbt-mode" nil t))
  (with-eval-after-load 'sbt-mode
    (substitute-key-definition 'minibuffer-complete-word
                               'self-insert-command
                               minibuffer-local-completion-map))

#+end_src

***** Package | lsp-metals

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-scala.el

  (straight-use-package 'lsp-metals)
  (setopt lsp-metals-server-args '("-J-Dmetals.allow-multiline-string-formatting=off" "-J-Dmetals.icons=unicode")
          lsp-metals-enable-semantic-highlighting t)
  (unless (fboundp 'lsp)
    (autoload #'lsp-deferred "lsp-mode"))
  (add-hook 'scala-mode-hook #'lsp)

#+end_src

***** Scala package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-scala.el

  (provide 'pg-programming-scala)

#+end_src

**** SQL

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-sql.el

  ;;; pg-programming-sql.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | sql

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-sql.el

  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (add-hook 'sql-mode-hook #'lsp-deferred)
  (unless (fboundp 'sqlind-minor-mode)
    (autoload #'sqlind-minor-mode "sql-indent" nil t))
  (add-hook 'sql-mode-hook #'sqlind-minor-mode)
  (add-hook 'sql-interactive-mode-hook #'(lambda ()
                                           (display-line-numbers-mode 0)
                                           (toggle-truncate-lines t)))
  (with-eval-after-load 'sql
    (setopt sql-connection-alist
            `((main (sql-product postgres)
                    (sql-port 5432)
                    (sql-server "localhost")
                    (sql-user (plist-get pg/user :user))
                    (sql-password ,(pg/lookup-password :host "localhost" :user (plist-get pg/user :user) :port 5432))
                    (sql-database (plist-get pg/user :user)))
              (school (sql-product postgres)
                      (sql-port 5432)
                      (sql-server "localhost")
                      (sql-user (plist-get pg/user :user))
                      (sql-password ,(pg/lookup-password :host "localhost" :user (plist-get pg/user :user) :port 5432))
                      (sql-database "ift2935")))))

#+end_src

***** Package | lsp-sql

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-sql.el

  (with-eval-after-load 'sql
    (with-eval-after-load 'lsp-mode
      (require 'lsp-sqls)))
  (with-eval-after-load 'lsp-sqls
    (setopt lsp-sqls-connections
            `(,(cl-pairlis '(driver dataSourceName)
                           `("postgresql" ,(concat "host=127.0.0.1 port=5432 user="
                                                   (plist-get pg/user :user)
                                                   "password="
                                                   (pg/lookup-password :host "localhost"
                                                                       :user (plist-get pg/user :user)
                                                                       :port 5432)
                                                   " dbname="(plist-get pg/user :user)
                                                   " sslmode=disable")))
              ,(cl-pairlis '(driver dataSourceName)
                           `("postgresql" ,(concat "host=127.0.0.1 port=5432 user="
                                                   (plist-get pg/user :user)
                                                   "password="
                                                   (pg/lookup-password :host "localhost"
                                                                       :user (plist-get pg/user :user)
                                                                       :port 5432)
                                                   " dbname=ift2935 sslmode=disable"))))))

#+end_src

***** Package | sql-indent

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-sql.el

  (straight-use-package 'sql-indent)
  (with-eval-after-load 'sql
    (require 'sql-indent))
  (with-eval-after-load 'sql-indent
    (setq-default sqlind-basic-offset 4))

#+end_src

***** SQL package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-sql.el

  (provide 'pg-programming-sql)

#+end_src

**** TypeScript

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-typescript.el

  ;;; pg-programming-typescript.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | typescript-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-typescript.el

  (straight-use-package 'typescript-mode)
  (unless (fboundp 'typescript-mode)
    (autoload #'typescript-mode "typescript-mode" nil t))
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-mode))
  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (add-hook 'typescript-mode-hook #'lsp-deferred)
  (dolist (fn #'(lsp-deferred
                 rainbow-mode))
    (add-hook 'tsx-ts-mode-hook fn))
  (with-eval-after-load 'typescript-mode
    (setopt typescript-indent-level 2))

#+end_src

***** Package | dap-node

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-typescript.el

  (with-eval-after-load 'typescript-mode
    (with-eval-after-load 'lsp-mode
      (require 'dap-node)))
  (with-eval-after-load 'dap-node
    (dap-node-setup))

#+end_src

***** Typescript package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-typescript.el

  (provide 'pg-programming-typescript)

#+end_src

**** XML

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-xml.el

  ;;; pg-programming-xml.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | nxml-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-xml.el

  (defun pg/close-tag ()
    (interactive)
    (insert ">")
    (save-excursion (pg/close-tag-maybe)))

  (defun pg/close-tag-maybe ()
    (when (looking-back "<[^/]*>")
      (nxml-finish-element)
      (delete-char -1)))

  (defun pg/newline-and-indent-maybe ()
    (interactive)
    (if (not (and (looking-back "<[^/]*>\s*")
                  (looking-at "\s*</[^/]*>")))
        (newline)
      (newline)
      (newline)
      (indent-according-to-mode)
      (previous-line)
      (indent-according-to-mode)))

  (with-eval-after-load 'nxml-mode
    (define-key nxml-mode-map (kbd ">") #'pg/close-tag)
    (define-key nxml-mode-map (kbd "RET") #'pg/newline-and-indent-maybe))

#+end_src

***** XML package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-xml.el

  (provide 'pg-programming-xml)

#+end_src

**** YAML

***** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-yaml.el

  ;;; pg-programming-yaml.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | yaml-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-yaml.el

  (straight-use-package 'yaml-mode)

#+end_src

***** YAML package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-programming-yaml.el

  (provide 'pg-programming-yaml)

#+end_src

** Notification

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-notification.el

  ;;; pg-notification.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | alert

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-notification.el

  (unless pg/is-windows
    (straight-use-package 'alert)
    (require 'alert)
    (with-eval-after-load 'alert
      (setopt alert-default-style 'notifications)))

#+end_src

