Emacs.org
*** Notification package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-notification.el

  (provide 'pg-notification)

#+end_src

** Org Mode

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  ;;; pg-org.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

