.emacs.d/lisp/pg-org.el
;;; pg-org.el -*- lexical-binding: t; -*-
;; Author: Philippe Gabriel
