.emacs.d/lisp/pg-org.el

(defun pg/org-screenshot ()
  "Take a screenshot into a time stamped unique-named file in the img directory
with respect to the org-buffer's location and insert a link to this
file. Requires imageMagick for undertaking screenshots."
  (interactive)
  (setq imgpath "./img/")
  (if (not (f-dir-p imgpath))
      (make-directory imgpath))
  (setq filename
        (concat
         (make-temp-name
          (concat imgpath
                  (let ((bname (string-trim (shell-command-to-string (concat "basename -s .org " buffer-file-name)))))
                    (with-temp-buffer
                      (call-process "echo" nil t nil "-n" bname)
                      (buffer-string)))
                  "_"
                  (format-time-string "%Y%m%d_%H%M%S_"))) ".png"))
  (call-process "grimshot" nil nil nil "--notify" "save" "area" filename)
  (insert (concat "[[" filename "]]"))
  (org-display-inline-images))

(defun pg/org-csv-to-table (beg end)
  "Insert a file into the current buffer at point, and convert it to an org
table."
  (interactive (list (mark) (point)))
  (org-table-convert-region beg end ","))

(defconst pg/org-view-html-tmp-dir "/tmp/org-html-preview/"
  "Directory of temporary html file to view.")

(defun pg/org-view-html ()
  "Views an org source html block in default browser"
  (interactive)
  (let ((elem (org-element-at-point))
        (temp-file-path (concat pg/org-view-html-tmp-dir (number-to-string (random (expt 2 32))) ".html")))
    (cond ((not (eq 'export-block (car elem)))
           (message "Not in an export block!"))
          ((not (string-equal (plist-get (car (cdr elem)) :type) "HTML"))
           (message "Export block is not HTML!"))
          (t (progn (f-mkdir pg/org-view-html-tmp-dir)
                    (f-write (plist-get (car (cdr elem)) :value) 'utf-8 temp-file-path)
                    (start-process "org-html-preview" nil "xdg-open" temp-file-path))))))

(defun pg/org-babel-tangle-config ()
  "Automatic tangle of org files."
  (when (eq major-mode #'org-mode)
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(defun pg/org-mode-setup ()
  "Define some behaviours for the major org-mode."
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (display-line-numbers-mode 0)
  (diminish 'org-indent-mode)
  (setq-local evil-auto-indent nil))

(straight-use-package 'org)
(require 'org)
(add-hook 'org-mode-hook #'pg/org-mode-setup)
(add-hook 'org-mode-hook #'(lambda ()
                             (add-hook 'after-save-hook #'pg/org-babel-tangle-config)))
(with-eval-after-load 'org
  (setopt org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-auto-align-tags nil
          org-tags-column 0
          org-catch-invisible-edits 'show-and-error
          org-special-ctrl-a/e t
          org-insert-heading-respect-content t
          org-pretty-entities t
          org-log-done 'time
          org-fontify-quote-and-verse-blocks t
          org-log-into-drawer t
          org-deadline-warning-days 7
          org-todo-keywords '((sequence "TODO(t)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k)"))
          ;; org-plantuml-jar-path (expand-file-name "~/.guix-home/profile/share/java/plantuml.jar")
          org-babel-python-command "python3"
          org-confirm-babel-evaluate nil
          org-agenda-exporter-settings `((ps-left-header (org-agenda-write-buffer-name))
                                         (ps-right-header ("/pagenumberstring load" ,(lambda ()
                                                                                       (format-time-string "%d/%m/%Y"))))
                                         (ps-font-size (12 . 11))
                                         (ps-top-margin 55)
                                         (ps-left-margin 35)
                                         (ps-right-margin 30)))

  (require 'org-indent)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font (plist-get pg/user :font-variable) :weight 'regular :height (cdr face)))

  (add-hook 'org-babel-after-execute-hook #'org-redisplay-inline-images)

  (defun pg/babel-ansi ()
    (when-let ((beg (org-babel-where-is-src-block-result nil nil)))
      (save-excursion
        (goto-char beg)
        (when (looking-at org-babel-result-regexp)
          (let ((end (org-babel-result-end))
                (ansi-color-context-region nil))
            (ansi-color-apply-on-region beg end))))))
  (add-hook 'org-babel-after-execute-hook #'pg/babel-ansi)

  (require 'org-tempo) ;; Allows defined snippets to expand into appropriate code blocks
  (dolist (template '(("sh" . "src sh")
                      ("java" . "src java")
                      ("als" . "src alloy")
                      ;; ("puml" . "src plantuml")
                      ("vhd" . "src vhdl")
                      ("asm" . "src mips")
                      ("lmc" . "src lmc-java")
                      ("cc" . "src c")
                      ("el" . "src emacs-lisp")
                      ("hs" . "src haskell")
                      ("py" . "src python")
                      ("jp" . "src jupyter-python")
                      ("sql" . "src sql")
                      ("for" . "src fortran")))
    (add-to-list 'org-structure-template-alist template))

  (dolist (src '(("als" . alloy)
                 ("lmc-java" . lmc-java)
                 ("plantuml" . plantuml)))
    (add-to-list 'org-src-lang-modes src))

  (with-eval-after-load 'general
    (pg/leader-keys
      "o" '(:ignore t :which-key "org")
      "os" '(pg/org-screenshot :which-key "screenshot")
      "oc" '(org-capture :which-key "capture")
      "oa" '(org-agenda :which-key "agenda")
      "ot" '(org-todo-list :which-key "todos")
      "ol" '(:ignore t :which-key "links")
      "olo" '(org-open-at-point :which-key "open")
      "olb" '(org-mark-ring-goto :which-key "back")))

  (unless pg/is-termux
    (setopt org-agenda-files (list (concat (plist-get pg/user :home) "/Sync/Agenda/"))
            org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                                   (vm-imap . vm-visit-imap-folder-other-frame)
                                   (gnus . org-gnus-no-new-news)
                                   (file . find-file)
                                   (wl . wl-other-frame))
            org-agenda-custom-commands '(("d" "Dashboard"
                                          ((agenda ""
                                                   ((org-deadline-warning-days 7)))
                                           (todo "TODO"
                                                 ((org-agenda-overriding-header "Tasks")))
                                           (tags-todo "agenda/ACTIVE"
                                                      ((org-agenda-overriding-header "Active Tasks")))))

                                         ("Z" "TODOs"
                                          ((todo "TODO"
                                                 ((org-agenda-overriding-header "Todos")))))

                                         ("m" "Misc" tags-todo "other")

                                         ("s" "Schedule" agenda ""
                                          ((org-agenda-files org-agenda-files)))

                                         ("w" "Work Status"
                                          ((todo "WAIT"
                                                 ((org-agenda-overriding-header "Waiting")
                                                  (org-agenda-files org-agenda-files)))
                                           (todo "REVIEW"
                                                 ((org-agenda-overriding-header "In Review")
                                                  (org-agenda-files org-agenda-files)))
                                           (todo "HOLD"
                                                 ((org-agenda-overriding-header "On Hold")
                                                  (org-agenda-todo-list-sublevels nil)
                                                  (org-agenda-files org-agenda-files)))
                                           (todo "ACTIVE"
                                                 ((org-agenda-overriding-header "Active")
                                                  (org-agenda-files org-agenda-files)))
                                           (todo "COMPLETED"
                                                 ((org-agenda-overriding-header "Completed")
                                                  (org-agenda-files org-agenda-files)))
                                           (todo "CANC"
                                                 ((org-agenda-overriding-header "Cancelled")
                                                  (org-agenda-files org-agenda-files))))))
            org-capture-templates `(("t" "Tasks / Projects")

                                    ("tt" "Task" entry
                                     (file+olp ,(concat (plist-get pg/user :home) "/Sync/Agenda/Tasks.org") "Active")
                                     "* TODO %? :task:\nDEADLINE: %U\n  %a\n  %i" :empty-lines 1)

                                    ("tr" "Repeat" entry
                                     (file+olp ,(concat (plist-get pg/user :home) "/Sync/Agenda/Tasks.org") "Repeat")
                                     "* TODO %? :task:\n%^{notify|repeat}p" :empty-lines 1)

                                    ("j" "Meetings")
                                    ("jm" "Meeting" entry
                                     (file+olp ,(concat (plist-get pg/user :home) "/Sync/Agenda/Tasks.org") "Waiting")
                                     "* TODO %? \nSCHEDULED: %U\n" :empty-lines 1)

                                    ("m" "Email Workflow")
                                    ("mr" "Follow Up" entry
                                     (file+olp ,(concat (plist-get pg/user :home) "/Sync/Agenda/Tasks.org") "Follow up")
                                     "* TODO %a\nDEADLINE: %U%?\n %i" :empty-lines 1))
            org-format-latex-options (plist-put org-format-latex-options :scale 1.5))))
