Emacs.org
*** Package | org-agenda

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (add-hook 'org-agenda-mode-hook #'(lambda ()
                                      (display-line-numbers-mode 0)))
  (with-eval-after-load 'org-agenda
    (setopt org-agenda-tags-column 0
            org-agenda-block-separator ?
            org-agenda-time-grid '((daily today require-timed)
                                   (800 1000 1200 1400 1600 1800 2000)
                                   "  " "")
            org-agenda-current-time-string " now "))

#+end_src

*** Package | org-appear

Toggles visibility of emphasis markers.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-appear)
  (unless (fboundp 'org-appear-mode)
    (autoload #'org-appear-mode "org-appear" nil t))
  (add-hook 'org-mode-hook #'org-appear-mode)

#+end_src

*** Package | org-contacts

Manages contacts

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-contacts)
  (with-eval-after-load 'org-contacts
    (setopt org-contacts-files (list (expand-file-name "~/Sync/Social/contacts.org"))))

#+end_src

*** Package | org-tree-slide

Allows for creation of slideshow presentations in emacs with org mode. The ~org-beamer-export-to-pdf~ command can be used to export the presentation as a pdf file - it requires ~pdflatex~. More detail [[https://orgmode.org/worg/exporters/beamer/tutorial.html][here]].

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (defun pg/presentation-setup ()
    "Setup before starting org presentation."
    (org-display-inline-images)
    (setq-local doom-modeline-minor-modes t
                org-format-latex-options (plist-put org-format-latex-options :scale 2.5)
                face-remapping-alist '((default (:height 1.75) default)))
    (org-latex-preview)
    (variable-pitch-mode 1))

  (defun pg/presentation-end ()
    "Cleanup after ending org presentation."
    (variable-pitch-mode 0)
    (setq-local doom-modeline-minor-modes nil
                org-format-latex-options (plist-put org-format-latex-options :scale 1.5)
                face-remapping-alist '((default variable-pitch default)))
    (org-latex-preview))

  (straight-use-package 'org-tree-slide)
  (unless (fboundp 'org-tree-slide-mode)
    (autoload #'org-tree-slide-mode "org-tree-slide" nil t))
  (with-eval-after-load 'general
    (pg/leader-keys
      "op" '(org-tree-slide-mode :which-key "slide")))
  (with-eval-after-load 'org-tree-slide
    (dolist (command '(org-tree-slide-before-move-next-hook
                       org-tree-slide-before-move-previous-hook))
      (add-hook command #'org-latex-preview))
    (add-hook 'org-tree-slide-play-hook #'pg/presentation-setup)
    (add-hook 'org-tree-slide-stop-hook #'pg/presentation-end)
    (setopt org-tree-slide-activate-message "Presentation started"
            org-tree-slide-deactivate-message "Presentation ended"
            org-tree-slide-breadcrumbs " > "
            org-tree-slide-header t
            org-image-actual-width nil))

#+end_src

*** Package | ox-reveal

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'ox-reveal)
  (unless (fboundp 'org-reveal-export-to-html)
    (autoload #'org-reveal-export-to-html "ox-reveal" nil t))
  (with-eval-after-load 'ox-reveal
    (setopt org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"
            org-reveal-hlevel 1
            org-export-headline-levels 6
            org-reveal-theme "league"))

#+end_src

*** Package | org-modern

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-modern)
  (with-eval-after-load 'org
    (setopt org-modern-list '((?+ . "")
                              (?- . "")
                              (?* . ""))
            org-modern-table nil)
    (global-org-modern-mode))

#+end_src

*** Package | org-notify

Handles notifications of scheduled tasks.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (unless pg/is-windows
    (straight-use-package 'org-notify)
    (with-eval-after-load 'org
      (require 'org-notify))
    (with-eval-after-load 'org-notify
      (org-notify-start)
      (setq org-notify-map nil)
      (org-notify-add 'default '( :time "1w"
                                  :actions (-notify/window)
                                  :period "1h"
                                  :duration 5))
      (org-notify-add 'repeat '( :time "1w"
                                 :actions (-notify/window)
                                 :period "1w"
                                 :duration 5))))

#+end_src

*** Package | org-msg

Allows for markup language when composing email

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-msg)
  (unless (fboundp 'org-msg-mode)
    (autoload #'org-msg-mode "org-msg" nil t))
  (add-hook 'mu4e-compose-pre-hook #'org-msg-mode)
  (with-eval-after-load 'org-msg
    (setopt org-msg-options "html-postamble:nil toc:nil author:nil num:nil \\n:t"
            org-msg-signature (concat "\n\nCordialement/Regards,\n\n*--*\n"
                                      "Philippe Gabriel - 40160338 \n[[mailto:pgabriel999@hotmail.com][pgabriel999@hotmail.com]]")
            org-msg-startup "indent inlineimages hidestars"
            org-msg-greeting-fmt "\nBonjour/Hi %s,\n\n"
            org-msg-greeting-name-limit 3
            org-message-convert-citation t
            org-msg-default-alternatives '((new html)
                                           (reply-to-text html)
                                           (reply-to-html html))
            org-msg-recipient-names nil))

#+end_src

*** Package | org-roam

Helps with note-taking strategies.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (with-eval-after-load 'org
    (straight-use-package 'org-roam)
    (require 'org-roam))
  (with-eval-after-load 'org-roam
    (setopt org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag))
            org-roam-directory (concat (plist-get pg/user :documents) "/Notes")
            org-roam-capture-templates '(("d" "default" plain
                                          "%?"
                                          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                             "#+title: ${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                          :unnarrowed t)
                                         ("a" "system admin" plain
                                          "%?"
                                          :if-new (file+head "IFT-3830/notes/%<%Y%m%d%H%M%S>-${slug}.org"
                                                             "#+title: ift3830-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                          :unnarrowed t)
                                         ("s" "distributed system design" plain
                                          "%?"
                                          :if-new (file+head "COMP-6231/notes/%<%Y%m%d%H%M%S>-${slug}.org"
                                                             "#+title: comp6231-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                          :unnarrowed t)))
    (org-roam-db-autosync-enable)
    (with-eval-after-load 'general
      (pg/leader-keys
        "on" '(:ignore t :which-key "notes")
        "onl" '(org-roam-buffer-toggle :which-key "links")
        "onf" '(org-roam-node-find :which-key "find/create")
        "oni" '(org-roam-node-insert :which-key "insert/create"))))

#+end_src

*** Package | org-fragtog

Allows display of latex fragments in org files.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-fragtog)
  (unless (fboundp 'org-fragtog-mode)
    (autoload #'org-fragtog-mode "org-fragtog" nil t))
  (add-hook 'org-mode-hook #'org-fragtog-mode)

#+end_src

