Emacs.org
*** Pomodoro timer

Custom pomodoro timer

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (defun pg/timer-setup ()
    "Sets up some parameters for the timer"
    (setq org-clock-sound (expand-file-name "~/Misc/ding.wav")))

  (defun pg/start-timer ()
    "Begins Pomodoro timer with study timer"
    (interactive)
    (pg/timer-setup)
    (pg/study-timer))

  (defun pg/start-with-break-timer ()
    "Begins Pomodoro timer with break timer"
    (interactive)
    (pg/timer-setup)
    (pg/break-timer))

  (defun pg/stop-timer ()
    "Stops the timer"
    (interactive)
    (setq org-clock-sound nil)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (org-timer-stop))

  (defun pg/study-timer ()
    "Study timer for 1 hour"
    (add-hook 'org-timer-done-hook #'pg/break-timer)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (setq org-timer-default-timer "1:00:00")
    (setq current-prefix-arg '(4)) ;; Universal argument
    (call-interactively #'org-timer-set-timer))

  (defun pg/break-timer ()
    "Break timer for 15 minutes"
    (add-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (setq org-timer-default-timer "15:00")
    (setq current-prefix-arg '(4)) ;; Universal argument
    (call-interactively #'org-timer-set-timer))

  (with-eval-after-load 'general
    (pg/leader-keys
      "ow" '(:ignore t :which-key "pomodoro")
      "owt" '(pg/start-timer :which-key "start")
      "owb" '(pg/start-with-break-timer :which-key "break")
      "ows" '(pg/stop-timer :which-key "stop")
      "owp" '(org-timer-pause-or-continue :which-key "pause")))

#+end_src

*** Org package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (provide 'pg-org)

#+end_src

** Viewers

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  ;;; pg-viewers.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | djvu

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'djvu)
  (require 'djvu)

#+end_src

*** Package | doc-view

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (unless (fboundp 'doc-view-mode)
    (autoload #'doc-view-mode "doc-view" nil t))
  (add-hook 'doc-view-mode-hook #'(lambda ()
                                    (display-line-numbers-mode 0)))

#+end_src

*** Package | elfeed

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'elfeed)
  (unless (fboundp 'elfeed)
    (autoload #'elfeed "elfeed" nil t))
  (add-hook 'elfeed-search-mode-hook #'(lambda ()
                                         (display-line-numbers-mode 0)))
  (add-hook 'elfeed-show-mode-hook #'(lambda ()
                                       (display-line-numbers-mode 0)))
  (with-eval-after-load 'elfeed
    (setopt elfeed-feeds '("https://www.gnu.org/software/guile/news/feed.xml"
                           "https://planet.emacslife.com/atom.xml"
                           "https://oneofus.la/have-emacs-will-hack/feed.xml"
                           "http://oremacs.com/atom.xml"
                           "https://updates.orgmode.org/feed/changes"
                           "http://pragmaticemacs.com/feed/"
                           "https://www.reddit.com/r/GUIX.rss"
                           "https://www.reddit.com/r/emacs.rss"
                           "https://www.reddit.com/r/orgmode.rss"
                           "https://blog.tecosaur.com/tmio/rss.xml")
            elfeed-search-filter "@6-months-ago"))

#+end_src

*** Package | nov

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'nov)
  (unless (fboundp 'nov-mode)
    (autoload #'nov-mode "nov" nil t))
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
  (add-hook 'nov-mode-hook #'(lambda ()
                               (display-line-numbers-mode 0)))
  (defun pg/nov-mode-setup ()
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq-local face-remapping-alist '((default (:height 1.5) default))))
  (add-hook 'nov-mode-hook #'pg/nov-mode-setup)

#+end_src

*** Package | pdf-tools

Allows for viewing of pdfs.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (unless (fboundp 'pdf-view-mode)
    (autoload #'pdf-view-mode "pdf-tools" nil t))
  (add-hook 'pdf-view-mode-hook #'(lambda ()
                                    (display-line-numbers-mode 0)))
  (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))

#+end_src

*** Viewers package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (provide 'pg-viewers)

#+end_src

** Bible

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  ;;; pg-bible.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | dtk

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  (straight-use-package 'dtk)
  (unless (fboundp 'dtk)
    (autoload #'dtk "dtk" nil t))
  (add-hook 'dtk-mode-hook #'(lambda ()
                               (setq-local face-remapping-alist
                                           '((default (:height 1.5) default)))))
  (with-eval-after-load 'dtk
    (setopt dtk-module "KJV"
            dtk-module-category "Biblical Texts"
            dtk-word-wrap t)
    (with-eval-after-load 'evil
      (evil-define-key 'normal 'dtk-mode-map
        (kbd "C-j") #'dtk-forward-verse
        (kbd "C-k") #'dtk-backward-verse
        (kbd "C-f") #'dtk-forward-chapter
        (kbd "C-b") #'dtk-backward-chapter
        "q" #'dtk-quit
        "c" #'dtk-clear-dtk-buffer
        "s" #'dtk-search)))

#+end_src

*** Bible package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  (provide 'pg-bible)

#+end_src

** Finances

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  ;;; pg-finance.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | ledger-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  (unless (fboundp 'ledger-mode)
    (autoload #'ledger-mode "ledger-mode" nil t))
  (add-to-list 'auto-mode-alist '("\\.dat\\'" . ledger-mode))
  (unless (fboundp 'company-mode)
    (autoload #'company-mode "company" nil t))
  (add-hook 'ledger-mode-hook #'company-mode)
  (add-hook 'ledger-report-mode-hook #'(lambda ()
                                         (display-line-numbers-mode 0)))
  (with-eval-after-load 'ledger-mode
    (setopt ledger-reconcile-default-commodity "CAD"
            ledger-binary-path (concat (plist-get pg/user :guix-home-profile) "/bin/ledger")
            ledger-clear-whole-transaction t))

#+end_src

*** Finances package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  (provide 'pg-finance)

#+end_src

** Social

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  ;;; pg-social.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | erc

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (dolist (mode '(erc-mode-hook
                  erc-list-menu-mode-hook))
    (add-hook mode #'(lambda ()
                       (display-line-numbers-mode 0))))
  (with-eval-after-load 'erc
    (unless (fboundp 'corfu-mode)
      (autoload #'corfu-mode "corfu" nil t))
    (add-hook 'erc-mode-hook #'corfu-mode)
    (setopt erc-server "irc.libera.chat"
            erc-nick (plist-get pg/user :user)
            erc-user (plist-get pg/user :name)
            erc-kill-buffer-on-part t
            erc-auto-query bury))

#+end_src

*** Package | ement

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (defun pg/ement-connect ()
    "Connects to matrix client with username and password supplied."
    (interactive)
    (ement-connect :user-id (concat "@" (plist-get pg/user :user) ":matrix.org")
                   :password (pg/lookup-password :host "matrix.org"
                                                 :user (plist-get pg/user :user))))

  (straight-use-package 'ement)
  (unless (fboundp 'ement-connect)
    (autoload #'ement-connect "ement" nil t))
  (add-hook 'ement-room-mode-hook #'(lambda ()
                                      (display-line-numbers-mode 0)))

  (with-eval-after-load 'general
    (pg/leader-keys
      "c" '(:ignore t :which-key "comms")
      "cm" '(:ignore t :which-key "matrix")
      "cmc" '(pg/ement-connect :which-key "start")))

  (with-eval-after-load 'ement
    (setopt ement-room-prism 'both
            ement-room-sender-headers t)
    (with-eval-after-load 'general
      (pg/leader-keys
        "cmd" '(ement-disconnect :which-key "disconnect"))))

#+end_src

*** Package | slack

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (straight-use-package 'slack)
  (unless (fboundp 'slack-start)
    (autoload #'slack-start "slack" nil t))
  (add-hook 'slack-mode-hook #'(lambda ()
                                 (display-line-numbers-mode 0)))
  (with-eval-after-load 'slack
    (setopt slack-prefer-current-team t
            slack-buffer-emojify t)
    (slack-register-team :name "ift6755"
                         :default t
                         :token (pg/lookup-password :host "ift6755.slack.com"
                                                    :user (plist-get pg/user :email-udem))
                         :cookie (pg/lookup-password :host "ift6755.slack.com"
                                                     :user (concat (plist-get pg/user :email-udem) "^cookie"))
                         :subscribed-channels '((general questions random))
                         :modeline-enabled t)
    (with-eval-after-load 'evil
      (evil-define-key 'normal slack-info-mode-map
        ",u" #'slack-room-update-messages)
      (evil-define-key 'normal slack-mode-map
        ",ra" #'slack-message-add-reaction
        ",rr" #'slack-message-remove-reaction
        ",rs" #'slack-message-show-reaction-users
        ",mm" #'slack-message-write-another-buffer
        ",me" #'slack-message-edit
        ",md" #'slack-message-delete))
    (with-eval-after-load 'general
      (pg/leader-keys
        "csc" '(slack-channel-select :which-key "channels")
        "csm" '(slack-im-select :which-key "message")
        "csr" '(slack-message-add-reaction :which-key "react"))))

  (with-eval-after-load 'general
    (pg/leader-keys
      "c" '(:ignore t :which-key "comms")
      "cs" '(:ignore t :which-key "slack")
      "csc" '(slack-start :which-key "start")))

#+end_src

*** Package | sx

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (straight-use-package 'sx)
  (unless (fboundp 'sx-search)
    (autoload #'sx-search "sx" nil t))

#+end_src

*** Social package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (provide 'pg-social)

#+end_src

** Weather

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-weather.el

  ;;; pg-weather.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | wttrin

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-weather.el

  (defun pg/wttrin-fetch-raw-string (query)
    "Get the weather information based on your QUERY."
    (let ((url-user-agent "curl"))
      (add-to-list 'url-request-extra-headers wttrin-default-accept-language)
      (with-current-buffer
          (url-retrieve-synchronously
           (concat "http://wttr.in/" query)
           (lambda (status) (switch-to-buffer (current-buffer))))
        (decode-coding-string (buffer-string) 'utf-8))))

  (straight-use-package 'wttrin)
  (unless (fboundp 'wttrin)
    (autoload #'wttrin "wttrin" nil t))
  (with-eval-after-load 'wttrin
    (fset #'wttrin-fetch-raw-string #'pg/wttrin-fetch-raw-string)
    (setopt wttrin-default-cities (list (plist-get pg/user :city))
            wttrin-default-accept-language '("Accept-Language" . "en-US")))

#+end_src

*** Weather package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-weather.el

  (provide 'pg-weather)

#+end_src

** Music

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-music.el

  ;;; pg-music.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | emms

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-music.el

  (straight-use-package 'emms)
  (unless (fboundp 'emms-smart-browse)
    (autoload #'emms-smart-browse "emms" nil t))
  (with-eval-after-load 'emms
    (require 'emms-setup)
    (require 'emms-player-mpd)
    (add-hook 'emms-playlist-cleared #'emms-player-mpd-clear)
    (setopt emms-source-file-default-directory (plist-get pg/user :music)
            emms-player-mpd-music-directory (plist-get pg/user :music)
            emms-player-list '(emms-player-mpd)
            emms-volume-change-function #'emms-volume-mpd-change)
    (emms-all)
    (emms-default-players)
    (add-to-list 'emms-player-list 'emms-player-mpd)
    (dolist (binding `((,(kbd "<XF86AudioPrev>") . ,#'emms-previous)
                       (,(kbd "<XF86AudioNext>") . ,#'emms-next)
                       (,(kbd "<XF86AudioPlay>") . ,#'emms-pause)
                       (,(kbd "<XF86AudioStop>") . ,#'emms-stop)))
      (define-key emms-browser-mode-map (car binding) (cdr binding))))

#+end_src

