.emacs.d/lisp/pg-org.el

(defun pg/timer-setup ()
  "Sets up some parameters for the timer"
  (setq org-clock-sound (expand-file-name "~/Misc/ding.wav")))

(defun pg/start-timer ()
  "Begins Pomodoro timer with study timer"
  (interactive)
  (pg/timer-setup)
  (pg/study-timer))

(defun pg/start-with-break-timer ()
  "Begins Pomodoro timer with break timer"
  (interactive)
  (pg/timer-setup)
  (pg/break-timer))

(defun pg/stop-timer ()
  "Stops the timer"
  (interactive)
  (setq org-clock-sound nil)
  (remove-hook 'org-timer-done-hook #'pg/study-timer)
  (remove-hook 'org-timer-done-hook #'pg/break-timer)
  (org-timer-stop))

(defun pg/study-timer ()
  "Study timer for 1 hour"
  (add-hook 'org-timer-done-hook #'pg/break-timer)
  (remove-hook 'org-timer-done-hook #'pg/study-timer)
  (setq org-timer-default-timer "1:00:00")
  (setq current-prefix-arg '(4)) ;; Universal argument
  (call-interactively #'org-timer-set-timer))

(defun pg/break-timer ()
  "Break timer for 15 minutes"
  (add-hook 'org-timer-done-hook #'pg/study-timer)
  (remove-hook 'org-timer-done-hook #'pg/break-timer)
  (setq org-timer-default-timer "15:00")
  (setq current-prefix-arg '(4)) ;; Universal argument
  (call-interactively #'org-timer-set-timer))

(with-eval-after-load 'general
  (pg/leader-keys
    "ow" '(:ignore t :which-key "pomodoro")
    "owt" '(pg/start-timer :which-key "start")
    "owb" '(pg/start-with-break-timer :which-key "break")
    "ows" '(pg/stop-timer :which-key "stop")
    "owp" '(org-timer-pause-or-continue :which-key "pause")))

(provide 'pg-org)
