Emacs.org
*** Package | emms-mode-line-cycle

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-music.el

  (defun pg/emms-mode-line-cycle--icon-function (&optional title initialp)
    "Format the current track TITLE like `emms-mode-line-icon-function'. If
    INITIALP is no-nil, initialized."
    (concat " "
            emms-mode-line-icon-before-format
            ;; (emms-propertize "NP:" 'display emms-mode-line-icon-image-cache)
            (emms-mode-line-cycle--playlist-current title initialp)))

  (straight-use-package 'emms-mode-line-cycle)
  (with-eval-after-load 'emms
    (require 'emms-mode-line-cycle))
  (with-eval-after-load 'emms-mode-line-cycle
    (require 'emms-mode-line-icon)
    (fset #'emms-mode-line-cycle--icon-function #'pg/emms-mode-line-cycle--icon-function)
    (setopt emms-mode-line-cycle-use-icon-p t)
    (emms-mode-line 1)
    (emms-playing-time 1)
    (emms-mode-line-cycle 1))

#+end_src

*** Music package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-music.el

  (provide 'pg-music)

#+end_src

** Games

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-games.el

  ;;; pg-games.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | sudoku

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-games.el

  (straight-use-package 'sudoku)
  (unless (fboundp 'sudoku)
    (autoload #'sudoku "sudoku" nil t))
  (with-eval-after-load 'sudoku
    (setopt sudoku-style 'unicode
            sudoku-level 'hard))

#+end_src

*** Package | sokoban

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-games.el

  (straight-use-package 'sokoban)
  (unless (fboundp 'sokoban)
    (autoload #'sokoban "sokoban" nil t))
  (unless (fboundp 'sokoban-goto-level)
    (autoload #'sokoban-goto-level "sokoban" nil t))
  (add-hook 'sokoban-mode-hook #'(lambda ()
                                   (display-line-numbers-mode 0)))
  (with-eval-after-load 'sokoban
    (with-eval-after-load 'evil
      (evil-define-key 'normal sokoban-mode-map
        "h" #'sokoban-move-left
        "l" #'sokoban-move-right
        "j" #'sokoban-move-down
        "k" #'sokoban-move-up)))

#+end_src

*** Games package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-games.el

  (provide 'pg-games)

#+end_src

** Keybindings

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bindings.el

  ;;; pg-bindings.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | general

Allows for general custom keybindings definition to create own set of various keybindings.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bindings.el

  (straight-use-package 'general)
  (with-eval-after-load 'which-key
    (with-eval-after-load 'evil
      (require 'general)))

  (with-eval-after-load 'general
    (general-create-definer pg/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

#+end_src

*** Package | hydra

Allows the creation of keymaps for related commands and the ability to repeat terminal commands. Works in conjunction with the ~general~ package.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bindings.el

  (straight-use-package 'hydra)
  (unless (fboundp 'defhydra)
    (autoload #'defhydra "hydra"))

  (defhydra hydra-text-scale (:timeout 5)
    "Scale text."
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out"))

  (defhydra hydra-window-scale (:timeout 5)
    "Scale window."
    ("<" evil-window-decrease-width "width dec")
    (">" evil-window-increase-width "width inc")
    ("-" evil-window-decrease-height "height dec")
    ("+" evil-window-increase-height "height inc")
    ("=" balance-windows "balance"))

  (defhydra hydra-x-window-scale (:timeout 5)
    "Scale x window."
    ("<" (exwm-layout-shrink-window-horizontally 50) "width dec")
    (">" (exwm-layout-enlarge-window-horizontally 50) "width inc")
    ("-" (exwm-layout-shrink-window 50) "height dec")
    ("+" (exwm-layout-enlarge-window 50) "height inc")
    ("w" exwm-floating-toggle-floating "float toggle")
    ("f" exwm-layout-set-fullscreen "fullscreen"))

  (defhydra hydra-window-move (:timeout 5)
    "Move window."
    ("h" windmove-left "left")
    ("l" windmove-right "right")
    ("j" windmove-down "down")
    ("k" windmove-up "up"))

  (defhydra hydra-window-swap (:timeout 5)
    "Swap window."
    ("h" windmove-swap-states-left "left")
    ("l" windmove-swap-states-right "right")
    ("j" windmove-swap-states-down "down")
    ("k" windmove-swap-states-up "up"))

  (defhydra hydra-window-change (:timeout 5)
    "Change window."
    ("l" next-buffer "right")
    ("h" previous-buffer "left"))

  (defhydra hydra-eyebrowse-switch (:timeout 5)
    "Switch workspace."
    ("l" eyebrowse-next-window-config "next")
    ("h" eyebrowse-prev-window-config "prev"))

  (defhydra hydra-perspective-switch (:timeout 5)
    "Switch perspective."
    ("l" persp-next "next")
    ("h" persp-prev "prev"))

  (with-eval-after-load 'general
    (pg/leader-keys
      "s" '(:ignore t :which-key "scaling")
      "st" '(hydra-text-scale/body :which-key "scale text")
      "sw" '(hydra-window-scale/body :which-key "scale window")
      "sx" '(hydra-x-window-scale/body :which-key "scale x window")

      "w" '(:ignore t :which-key "window")
      "wm" '(hydra-window-move/body :which-key "move")
      "ws" '(hydra-window-swap/body :which-key "swap")
      "wc" '(hydra-window-change/body :which-key "change")))

#+end_src

*** Package | iso-transl

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bindings.el

  (require 'iso-transl)
  (with-eval-after-load 'iso-transl
    (global-set-key (kbd "<Multi_key>") #'iso-transl-ctl-x-8-map))

#+end_src

*** Keybindings package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bindings.el

  (provide 'pg-bindings)

#+end_src

* Emacs Profile

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/early-init.el

  ;;; early-init.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

  (setopt package-enable-at-startup nil)

#+end_src

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/init.el

  ;;; init.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

  (setq gc-cons-threshold (* 50 1000 1000)) ;; Sets garbage collection threshold high enough

  (push (expand-file-name "lisp" user-emacs-directory) load-path)
  (push (expand-file-name "themes" user-emacs-directory) custom-theme-load-path)

  (defconst pg/user
    `( :user "phil-gab99"
       :name "Philippe Gabriel"
       :email "pgabriel999@hotmail.com"
       :email-udem "philippe.gabriel.1@umontreal.ca"
       :city "montreal"
       :font-fixed "JetBrains Mono"
       :font-variable "Iosevka Aile"
       :home ,(or (getenv "HOME") (expand-file-name "~"))
       :cache ,(or (getenv "XDG_CACHE_HOME") (expand-file-name ".cache" "~"))
       :config ,(or (getenv "XDG_CONFIG_HOME") (expand-file-name ".config" "~"))
       :documents ,(or (getenv "XDG_DOCUMENTS_DIR") (expand-file-name "Documents" "~"))
       :download ,(or (getenv "XDG_DOWNLOAD_DIR") (expand-file-name "Downloads" "~"))
       :music ,(or (getenv "XDG_MUSIC_DIR") (expand-file-name "Music" "~"))
       :dotfiles ,(expand-file-name ".dotfiles" "~")
       :guix-home-profile ,(expand-file-name ".guix-home/profile" "~"))
    "Plist holding user details")

  ;; System related constants
  (defconst pg/is-termux
    (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a")))
    "Determines whether the current system is an Android based system.")
  (defconst pg/is-windows (eq system-type 'windows-nt)
    "Determines whether the current system is a Windows based system.")
  (defconst pg/is-linux (eq system-type 'gnu/linux)
    "Determines whether the current system is a GNU/Linux based system.")
  (defconst pg/is-guix-system
    (and pg/is-linux
         (string-match-p (regexp-quote "(guix@guix)")
                         (shell-command-to-string "cat /proc/version")))
    "Determines whether the current system is a GNU/Linux based system running the
    GNU Guix distribution.")
  (defconst pg/exwm-enabled
    (getenv "EXWM")
    "Determines whether the EXWM is currently running.")

  (defun pg/close-all-buffers ()
    "Closes all emacs buffers."
    (interactive)
    (mapc 'kill-buffer (buffer-list)))

  (defun pg/save-buffers-kill-emacs ()
    "Closes all emacs buffers before exiting emacs."
    (interactive)
    (if pg/exwm-enabled (pg/kill-panel))
    (save-buffers-kill-emacs))

  (global-set-key (kbd "C-x C-c") #'pg/save-buffers-kill-emacs)

  (setopt load-prefer-newer t
          use-short-answers t
          auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
          warning-suppress-log-types '((lsp-mode))
          warning-suppress-types '((lsp-mode))
          warning-minimum-level :error
          help-at-pt-display-when-idle t)

  (require 'pg-startup)
  (if pg/exwm-enabled (require 'pg-desktop))

  (dolist (package '(pg-ui
                     pg-bindings
                     pg-org
                     pg-completion
                     pg-editing
                     pg-native-compilation
                     pg-guix
                     pg-passwords
                     pg-keylog
                     pg-buffer
                     pg-email
                     pg-help
                     pg-web
                     pg-file
                     pg-shell

                     pg-project
                     pg-programming
                     pg-programming-ada
                     ;; pg-programming-alloy
                     pg-programming-arduino
                     pg-programming-cc
                     pg-programming-clojure
                     ;; pg-programming-commonlisp
                     pg-programming-css
                     pg-programming-docker
                     pg-programming-elisp
                     pg-programming-erlang
                     pg-programming-gdscript
                     pg-programming-git
                     pg-programming-groovy
                     pg-programming-haskell
                     pg-programming-html
                     pg-programming-i3config
                     pg-programming-java
                     pg-programming-json
                     ;; pg-programming-lmc
                     pg-programming-markdown
                     pg-programming-mips
                     pg-programming-php
                     pg-programming-prolog
                     pg-programming-python
                     pg-programming-scala
                     ;; pg-programming-smtlibv2
                     pg-programming-sql
                     pg-programming-javascript
                     pg-programming-tex
                     pg-programming-typescript
                     ;; pg-programming-vhdl
                     pg-programming-xml
                     pg-programming-yaml

                     pg-notification
                     pg-viewers
                     ;; pg-bible
                     pg-finance
                     pg-social
                     pg-weather
                     pg-music
                     pg-games))
    (require package))

  ;; This section needs to be at the end so that Emacs doesn't complain about packages not being on load path
  (unless pg/is-windows
    (require 'ob-jupyter)
    (org-babel-do-load-languages ;; Loads languages to be executed by org-babel
     'org-babel-load-languages '((emacs-lisp . t)
                                 (java . t)
                                 (shell . t)
                                 ;; (plantuml . t)
                                 (python . t)
                                 (arduino . t)
                                 (jupyter . t)))

    (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                         (:session . "py")
                                                         (:kernel . "python3")))
    (setf (alist-get "jupyter-python" org-src-lang-modes nil nil #'equal) 'python-ts))

  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src
